0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
    version	2.0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (40 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }
    
    body
    {
    	type		noSlip;
    }
    
    optSurface
    {
    	type		noSlip;
    }
    
    wheelFL
    {
	type		rotatingWallVelocity;
	origin		(25.936 0.287 0.972);
	axis		(0 0 1);
	omega 		119.4;
    } 
    
    wheelRL
    {
	type		rotatingWallVelocity;
	origin		(28.901 0.287 0.972);
	axis		(0 0 1);
	omega 		119.4;
    } 
       
    symmetry
    {
    	type 		symmetry;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
