0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
    version	2.0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }

    body
    {
        type            zeroGradient;
    }
    
    optSurface
    {
        type            zeroGradient;
    }
    
    wheelFL
    {
    	type		zeroGradient;
    }
        
    wheelRL
    {
    	type		zeroGradient;
    }
    
    symmetry
    {
    	type 		symmetry;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
