system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 	2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// adjustTimeStep  yes;

// maxCo           1;

functions
{
	/*#includeFunc	residuals;
	
    	wallShearStress
    	{
       	    type                wallShearStress;
       	    functionObjectLibs  ("libfieldFunctionObjects.so");
            writeControl        timeStep;
       	    writeInterval       50;
    	}
    	
    	forceCoeffs
	{
	    type        forceCoeffs;
	    libs        ("libforces.so");
	    patches	(body optSurface wheelFL wheelRL);
	    
            writeControl timeStep;
            writeInterval 1;
	    
	    CofR	(5.742 0.144 0.935);
    	    liftDir     (0 1 0);
	    dragDir     (1 0 0);
	    pitchAxis   (0 0 1);
	    
	    magUInf	40;
	    lRef	1;
	    Aref	0.09556;
	    rho		rhoInf;
	    rhoInf	1;
	}*/
	
}

// ************************************************************************* //
