system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    body.stl
    {
        type triSurfaceMesh;

	name body;

	//scale 0.001;
    }
    
    fastback.stl
    {
        type triSurfaceMesh;
	name optSurface;

	//scale 0.001;
    }
    
    front_intakes.stl
    {
        type triSurfaceMesh;

	name frontIntakes;

	//scale 0.001;
    }
    
    lights_front.stl
    {

	type triSurfaceMesh;

	name lightsFront;

	//scale 0.001;
    }

    Mirror_stripe.stl
    {

	type triSurfaceMesh;

        name mirrorStripe;

	//scale 0.001;
    }

    Mirrors.stl
    {

	type triSurfaceMesh;

	name 	mirrors;

	//scale 0.001;
    }

    tyres_fr.stl
    {

        type triSurfaceMesh;

        name    tyresFront;

        //scale 0.001;
    }

    tyres_rear.stl
    {

        type triSurfaceMesh;

        name    tyresRear;

        //scale 0.001;
    }

    Underbody_Smooth.stl
    {

        type triSurfaceMesh;

        name    underbody;

        //scale 0.001;
    }

    wheels_fr.stl
    {

        type triSurfaceMesh;

        name    wheelsFront;

        //scale 0.001;
    }

    wheels_rear.stl
    {

        type triSurfaceMesh;

        name    wheelsRear;

        //scale 0.001;
    }

    windows.stl
    {

        type triSurfaceMesh;

        name    windowsFront;

        //scale 0.001;
    }

    windows_rear.stl
    {

        type triSurfaceMesh;

        name    windowsRear;

        //scale 0.001;
    }
    
    box1
    {
    	type searchableBox;
        min (-10.5 -0.5 0);
        max (20 3 3);
   }
   
    box2
    {
    	type searchableBox;
        min (-5 -0.5 0);
        max (10 2 2);
   }
   
    box3
    {
    	type searchableBox;
        min (-1 -0.5 0);
        max (5 1.5 1.2);
   }
};

castellatedMeshControls
{
    maxLocalCells 2000000;
    maxGlobalCells 5000000;
    maxLoadUnbalance 0.10;
    minRefinementCells 10;
    nCellsBetweenLevels 2;
    
    features
    (
    );

    refinementSurfaces
    {
    body { level (4 5); patchInfo { type wall; } }
    optSurface { level (4 5); patchInfo { type wall; } }
    frontIntakes { level (5 6); patchInfo { type wall; } }
    lightsFront { level (5 6); patchInfo { type wall; } }
    mirrorStripe { level (6 6); patchInfo { type wall; } }
    mirrors { level (5 6); patchInfo { type wall; } }
    tyresFront { level (4 5); patchInfo { type wall; } }
    
    // Replace wildcards with exact names:
    tyresRear { level (4 5); patchInfo { type wall; } }
    underbody { level (4 5); patchInfo { type wall; } }
    
    wheelsFront { level (4 5); patchInfo { type wall; } }
    wheelsRear { level (4 5); patchInfo { type wall; } }
    
    windowsFront { level (4 5); patchInfo { type wall; } }
    windowsRear { level (4 5); patchInfo { type wall; } }
    }

    resolveFeatureAngle 30;
    

    refinementRegions
    {
       box1
       {
             mode inside;
             levels ((1 1));
       }
       
       box2
       {
             mode inside;
             levels ((2 2));
       }

       box3
       {
             mode inside;
             levels ((3 3));
       }
    }

    locationInMesh	(15 1e-5 1e-5);
    
    allowFreeStandingZoneFaces true;
}

snapControls
{

    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;

    //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        body
        {
            nSurfaceLayers 0;
        }
        
        optSurface
        {
            nSurfaceLayers 0;
        }
        
        /*wheelFL
        {
            nSurfaceLayers 0;
        }
        
        wheelRL
        {
            nSurfaceLayers 0;
        }*/
    }

    expansionRatio 1.2;
    finalLayerThickness 0.5;
    minThickness 0.05;
    nGrow 0;

    // Advanced settings
    featureAngle 60;
    nRelaxIter 10;
    nSmoothSurfaceNormals 20;
    nSmoothNormals 10;
    nSmoothThickness 10;
    maxFaceThicknessRatio 1;
    maxThicknessToMedialRatio 1;
    minMedianAxisAngle 130;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 60;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;


    // Advanced

    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;

mergeTolerance 1e-6;

// ************************************************************************* //
